# SL_Export

## Description
Export Spotlight Data to xml file.

```pascal
PROCEDURE SL_Export(
				exportType : INTEGER;
				instHand   : HANDLE;
				fieldName  : DYNARRAY[] of CHAR);
```

```python
def vs.SL_Export(exportType, instHand, fieldName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|exportType|INTEGER|   |
|instHand|HANDLE|   |
|fieldName|DYNARRAY[] of CHAR|   |

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight